Unable to trim slanted column end geometry to desired condition.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SlantedColumnCannotCutEndWarn { get; }
  Visual Basic
Public Shared ReadOnly Property SlantedColumnCannotCutEndWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SlantedColumnCannotCutEndWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SlantedColumnFailures Class
  Autodesk.Revit.DB Namespace